J-f-Jensen/ONECYLINDERECU/MSIIFORXT660ECU FreeScale/Sources/MC9S12T64.H
#ifndef _MC9S12T64_H
#define _MC9S12T64_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */

#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

//not in generic.h
//#define pPORTA   ((volatile unsigned char*)(0x0000))

//Redefine port A + B + E
#define PORTA_PA0 PORTA_BIT0
#define PORTA_PA1 PORTA_BIT1
#define PORTA_PA2 PORTA_BIT2
#define PORTA_PA3 PORTA_BIT3
#define PORTA_PA4 PORTA_BIT4
#define PORTA_PA5 PORTA_BIT5
#define PORTA_PA6 PORTA_BIT6
#define PORTA_PA7 PORTA_BIT7

#define PORTB_PB0 PORTB_BIT0
#define PORTB_PB1 PORTB_BIT1
#define PORTB_PB2 PORTB_BIT2
#define PORTB_PB3 PORTB_BIT3
#define PORTB_PB4 PORTB_BIT4
#define PORTB_PB5 PORTB_BIT5
#define PORTB_PB6 PORTB_BIT6
#define PORTB_PB7 PORTB_BIT7

#define PORTE_PE0 PORTE_BIT0
#define PORTE_PE1 PORTE_BIT1
#define PORTE_PE2 PORTE_BIT2
#define PORTE_PE3 PORTE_BIT3
#define PORTE_PE4 PORTE_BIT4
#define PORTE_PE5 PORTE_BIT5
#define PORTE_PE6 PORTE_BIT6
#define PORTE_PE7 PORTE_BIT7

#define DDRA_DDRA0 DDRA_BIT0
#define DDRA_DDRA1 DDRA_BIT1
#define DDRA_DDRA2 DDRA_BIT2
#define DDRA_DDRA3 DDRA_BIT3
#define DDRA_DDRA4 DDRA_BIT4
#define DDRA_DDRA5 DDRA_BIT5
#define DDRA_DDRA6 DDRA_BIT6
#define DDRA_DDRA7 DDRA_BIT7

#define DDRB_DDRB0 DDRB_BIT0
#define DDRB_DDRB1 DDRB_BIT1
#define DDRB_DDRB2 DDRB_BIT2
#define DDRB_DDRB3 DDRB_BIT3
#define DDRB_DDRB4 DDRB_BIT4
#define DDRB_DDRB5 DDRB_BIT5
#define DDRB_DDRB6 DDRB_BIT6
#define DDRB_DDRB7 DDRB_BIT7

#define DDRE_DDRE0 DDRE_BIT0
#define DDRE_DDRE1 DDRE_BIT1
#define DDRE_DDRE2 DDRE_BIT2
#define DDRE_DDRE3 DDRE_BIT3
#define DDRE_DDRE4 DDRE_BIT4
#define DDRE_DDRE5 DDRE_BIT5
#define DDRE_DDRE6 DDRE_BIT6
#define DDRE_DDRE7 DDRE_BIT7

/*
#define pPTT     ((volatile unsigned char*)(0x0240))
#define pPTM     ((volatile unsigned char*)(0x0250))
#define pTC0    ((volatile unsigned short*)(0x0050))
#define pTC1    ((volatile unsigned short*)(0x0052))
#define pTC2    ((volatile unsigned short*)(0x0054))
#define pTC3    ((volatile unsigned short*)(0x0056))
#define pTC4    ((volatile unsigned short*)(0x0058))
#define pTC5    ((volatile unsigned short*)(0x005A))
#define pTC6    ((volatile unsigned short*)(0x005C))
#define pTC7    ((volatile unsigned short*)(0x005E))
*/

//#define TIOS   (*((volatile unsigned char*)(0x0040)))   //timer input cap/output comp select
//#define CFORC  (*((volatile unsigned char*)(0x0041)))   //timer compare force register
//#define TCNT   (*((volatile unsigned short*)(0x0044)))  //timer count register
//#define TCTL1  (*((volatile unsigned char*)(0x0048)))   //timer control register 1
//#define TCTL2  (*((volatile unsigned char*)(0x0049)))   //timer control register 2
//#define TIE    (*((volatile unsigned char*)(0x004C)))   //timer interrupt enable register
//#define TSCR1  (*((volatile unsigned char*)(0x0046)))   //timer system control register 1
//#define TSCR2  (*((volatile unsigned char*)(0x004D)))   //timer system control register 2

//#define PWME   (*((volatile unsigned char*)(0x00A0)))   //PWM enable register
//#define PWMPOL (*((volatile unsigned char*)(0x00A1)))   //PWM polarity register
//#define PWMCLK (*((volatile unsigned char*)(0x00A2)))   //PWM clock select register
//#define PWMPRCLK (*((volatile unsigned char*)(0x00A3))) //PWM prescale clock select register
//#define PWMCAE  (*((volatile unsigned char*)(0x00A4)))  //PWM center align enable register
//#define PWMSCLA (*((volatile unsigned char*)(0x00A8)))  //PWM scale A register
//#define PWMSCLB (*((volatile unsigned char*)(0x00A9)))  //PWM scale A register

//#define PWMDTY2 (*((volatile unsigned char*)(0x00BE)))  //PWM channel duty register
//#define PWMDTY3 (*((volatile unsigned char*)(0x00BF)))  //PWM channel duty register
//#define PWMDTY4 (*((volatile unsigned char*)(0x00C0)))  //PWM channel duty register

//#define PWMPER2 (*((volatile unsigned char*)(0x00B6)))  //PWM channel period register
//#define PWMPER3 (*((volatile unsigned char*)(0x00B7)))  //PWM channel period register
//#define PWMPER4 (*((volatile unsigned char*)(0x00B8)))  //PWM channel period register

//#define PWMCNT0 (*((volatile unsigned char*)(0x00AC)))  //PWM channel counter register
//#define PWMCNT1 (*((volatile unsigned char*)(0x00AD)))  //PWM channel counter register
//#define PWMCNT2 (*((volatile unsigned char*)(0x00AE)))  //PWM channel counter register
//#define PWMCNT3 (*((volatile unsigned char*)(0x00AF)))  //PWM channel counter register
//#define PWMCNT4 (*((volatile unsigned char*)(0x00B0)))  //PWM channel counter register

//#define TCTL1  (*((volatile unsigned char*)(0x0048)))   //timer control register 1
//#define TCTL2  (*((volatile unsigned char*)(0x0049)))   //timer control register 2
//#define TCTL3  (*((volatile unsigned char*)(0x004A)))   //timer control register 3
//#define TCTL4  (*((volatile unsigned char*)(0x004B)))   //timer control register 4

//#define TC0    (*((volatile unsigned short*)(0x0050)))  //TIMER CHANNEL REGISTER
//#define TC1    (*((volatile unsigned short*)(0x0052)))  //TIMER CHANNEL REGISTER
//#define TC2    (*((volatile unsigned short*)(0x0054)))  //TIMER CHANNEL REGISTER
//#define TC3    (*((volatile unsigned short*)(0x0056)))  //TIMER CHANNEL REGISTER
//#define TC4    (*((volatile unsigned short*)(0x0058)))  //TIMER CHANNEL REGISTER
//#define TC5    (*((volatile unsigned short*)(0x005A)))  //TIMER CHANNEL REGISTER
//#define TC6    (*((volatile unsigned short*)(0x005C)))  //TIMER CHANNEL REGISTER
//#define TC7    (*((volatile unsigned short*)(0x005E)))  //TIMER CHANNEL REGISTER

//#define TFLG1  (*((volatile unsigned char*)(0x004E)))   //main timer interrupt flag 1
//#define TFLG2  (*((volatile unsigned char*)(0x004F)))   //main timer interrupt flag 2


/*** TC0 - Timer Input Capture/Output Compare Register 0; 0x00000050 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TC0Hi - Timer Input Capture/Output Compare Register 0 High; 0x00000050 ***/
    union {
      byte Byte;
    } TC0HiSTR;
    #define TC0Hi                       _TC0.Overlap_STR.TC0HiSTR.Byte
    

    /*** TC0Lo - Timer Input Capture/Output Compare Register 0 Low; 0x00000051 ***/
    union {
      byte Byte;
    } TC0LoSTR;
    #define TC0Lo                       _TC0.Overlap_STR.TC0LoSTR.Byte
    
  } Overlap_STR;

